Config/Documents/ФормированиеЗаписейРаздела7ДекларацииНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФормированиеЗаписейРаздела7ДекларацииНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСЗаписиРаздела7Декларации</xr:Item>
				<xr:Item>AccumulationRegister.НДСНеоблагаемыеОперации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НеоблагаемыеНДСОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КодыОперацийРаздела7ДекларацииПоНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриобретения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСПрямой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРеализации</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументРеализацииНеоблагаемыеНДСОперации</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСРаспределенный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодтверждающиеДокументыПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/КодыОперацийРаздела7ДекларацииПоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КодыОперацийРаздела7ДекларацииПоНДС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОперацияНеПодлежитНалогообложению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНеоблагаемойОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаетсяВРеестрПодтверждающихДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ФормированиеЗаписейРаздела7ДекларацииНДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаКомментарийОтветственный);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект,
		"КнопкаЗаполнитьДокумент,КнопкаРассчитатьГрафы3и4,КнопкаРассчитатьГрафы3и4Прямой,КнопкаРассчитатьГрафу4Распределенный,"
		+ "КнопкаРасшифроватьГрафы3и4,КнопкаРасшифроватьГрафу4Распределенный");
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьРеквизитыИзПараметровФормы(ЭтаФорма);
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	ТекущаяДатаДокумента = Объект.Дата;
	ТекущаяОрганизация   = Объект.Организация;
	
	РассчитанаГрафа4Распределенный = Истина;
	РассчитаныГрафы3и4Прямой = Истина;
	НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
	
	ОбновитьИтогиВПодвале(ЭтаФорма);
	УстановитьУсловноеОформление();
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
	Если ЗавершениеРаботы
		И Модифицированность
		И (Не РассчитаныГрафы3и4Прямой Или Не РассчитанаГрафа4Распределенный) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не РассчитаныГрафы3и4Прямой Или Не РассчитанаГрафа4Распределенный Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'НДС не был распределен по операциям. Распределить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	ИначеЕсли ИмяСобытия = "РедактированиеСпискаПодтверждающихДокументов" Тогда 
		
		КлючПоиска = Новый Структура("КлючСтроки", Параметр.КлючСтроки);
		МассивСтрокПодтверждающиеДокументы = Объект.ПодтверждающиеДокументы.НайтиСтроки(КлючПоиска);
		
		Для Каждого СтрокаТЧ Из МассивСтрокПодтверждающиеДокументы Цикл
			Объект.ПодтверждающиеДокументы.Удалить(СтрокаТЧ);
		КонецЦикла;
		
		АдресТаблицыПодтверждающиеДокументы = Параметр.АдресТаблицыПодтверждающиеДокументы;
		ЗагрузитьПодтверждающиеДокументыИзХранилища(Параметр.КлючСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом  
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	КолвоСтрокНеоблагаемыеНДСОперации = Объект.НеоблагаемыеНДСОперации.Количество();
	МаксимальноеКоличествоСтрок = 99999;
	Если КолвоСтрокНеоблагаемыеНДСОперации > МаксимальноеКоличествоСтрок Тогда
		
		КоличествоСтрокДляПереноса = КолвоСтрокНеоблагаемыеНДСОперации - МаксимальноеКоличествоСтрок;
		КоличествоНовыхДокументов = Цел(КоличествоСтрокДляПереноса / МаксимальноеКоличествоСтрок) + 
			?(КоличествоСтрокДляПереноса % МаксимальноеКоличествоСтрок <> 0, 1, 0);
		Отказ = Истина;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КоличествоСтрокДляПереноса",КоличествоСтрокДляПереноса);
		ДополнительныеПараметры.Вставить("РежимЗаписи",ПараметрыЗаписи.РежимЗаписи);
		ДополнительныеПараметры.Вставить("КоличествоНовыхДокументов",КоличествоНовыхДокументов);
		ДополнительныеПараметры.Вставить("МаксимальноеКоличествоСтрок",МаксимальноеКоличествоСтрок);
		ДополнительныеПараметры.Вставить("КоличествоСтрокДляПереноса",КоличествоСтрокДляПереноса);
		Оповещение = Новый ОписаниеОповещения("ВопросПеренестиЛишниеСтрокиТЧВДругойДокумент",ЭтотОбъект,ДополнительныеПараметры);
		
		ТекстВопроса = НСтр("ru='В табличные части можно записать не более '")+
				Строка(МаксимальноеКоличествоСтрок)+ НСтр("ru=' строк.
				|Перенести '")+
				ТекстКоличествоСтрокДляПереноса("последняя строка",КоличествоСтрокДляПереноса)+
				?(КоличествоНовыхДокументов = 1,НСтр("ru=' в новый документ?'"),НСтр("ru=' в новые документы?'"));
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;     // Чтобы не вызывалось по умолчанию платформеннная ошибка "Табличная часть содержит более 99999 строк"
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.НеоблагаемыеНДСОперации.Количество() <> 0
		ИЛИ Объект.ПодтверждающиеДокументы.Количество() <> 0 Тогда 
		ТекстВопроса = НСтр("ru = 'Необходимо очистить табличную часть. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПриИзмененииОрганизацииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Иначе
		ПриИзмененииОрганизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ПриИзмененииДатыСервер();
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНеоблагаемыеНДСОперации

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииПодтверждающиеДокументыПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.НеоблагаемыеНДСОперации.ТекущиеДанные;
	
	Если Не ТекДанные.ВключаетсяВРеестр Тогда
		СообщитьОНеуказанииПодтверждающихДокументов();
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтрока = Элементы.НеоблагаемыеНДСОперации.ТекущаяСтрока;
	ОткрытьФормуРедактированияПодтверждающихДокументов(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "НеоблагаемыеНДСОперацииПодтверждающиеДокументыПредставление" Тогда
		ТекДанные = Элементы.НеоблагаемыеНДСОперации.ТекущиеДанные;
		
		Если Не ТекДанные.ВключаетсяВРеестр Тогда
			СообщитьОНеуказанииПодтверждающихДокументов();
			Возврат;
		КонецЕсли;
		
		ОткрытьФормуРедактированияПодтверждающихДокументов(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииКодОперацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НеоблагаемыеНДСОперации.ТекущиеДанные;
	
	ПрежнееЗначениеТребуетсяЗаполнениеГраф3И4 = ТекущиеДанные.ТребуетсяЗаполнениеГраф3И4;
	
	РеквизитыКодаОперации = РеквизитыКодаОперации(ТекущиеДанные.КодОперации);
	ТекущиеДанные.КодСт149НКРФ      = РеквизитыКодаОперации.ОперацияНеПодлежитНалогообложению;
	ТекущиеДанные.ВключаетсяВРеестр = РеквизитыКодаОперации.ВключаетсяВРеестрПодтверждающихДокументов;
	ТекущиеДанные.ТребуетсяЗаполнениеГраф3И4 = РеквизитыКодаОперации.ТребуетсяЗаполнениеГраф3И4;
	ТекущиеДанные.КонтрагентОбязательный = УчетНДСКлиентСервер.КонтрагентОбязательный(ТекущиеДанные.ДокументРеализации);
	
	Если ПрежнееЗначениеТребуетсяЗаполнениеГраф3И4 И Не ТекущиеДанные.ТребуетсяЗаполнениеГраф3И4 Тогда
		ОчиститьНеиспользуемыеПоказателиСтроки(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииДокументРеализацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НеоблагаемыеНДСОперации.ТекущиеДанные;
	ТекущиеДанные.КонтрагентОбязательный = УчетНДСКлиентСервер.КонтрагентОбязательный(ТекущиеДанные.ДокументРеализации);
	
КонецПроцедуры

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекДанныеНеоблагаемыеНДСОперации = Элементы.НеоблагаемыеНДСОперации.ТекущиеДанные;
		ТекДанныеНеоблагаемыеНДСОперации.КлючСтроки = Новый УникальныйИдентификатор;
		
		ТекДанныеНеоблагаемыеНДСОперации.ПодтверждающиеДокументыПредставление = "<...>";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьИтогиВПодвале(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииПослеУдаления(Элемент)
	
	ОбновитьИтогиВПодвале(ЭтаФорма);
	
	РассчитаныГрафы3и4Прямой = Ложь;
	РассчитанаГрафа4Распределенный = Ложь;
	НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	РассчитаныГрафы3и4Прямой = Ложь;
	РассчитанаГрафа4Распределенный = Ложь;
	НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура НеоблагаемыеНДСОперацииСуммаРеализацииПриИзменении(Элемент)
	
	РассчитаныГрафы3и4Прямой = Ложь;
	РассчитанаГрафа4Распределенный = Ложь;
	НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	Если Объект.НеоблагаемыеНДСОперации.Количество() > 0 Тогда 
		Если Объект.Проведен Тогда 
			ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено, а табличные части будут очищены. Заполнить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Табличные части будут очищены. Заполнить?'");
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьДокументЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьЗаполнениеДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафы3и4(Команда)
	
	Отказ = Ложь;
	
	ПроверитьПередРасчетомГраф3и4(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьГрафы3и4Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафы3и4Прямой(Команда)
	
	Отказ = Ложь;
	
	ПроверитьПередРасчетомГраф3и4(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьГрафы3и4ПрямойКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафу4Распределенный(Команда)
	
	Отказ = Ложь;
	
	ПроверитьПередРасчетомГраф3и4(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьГрафу4РаспределенныйКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьГрафы3и4Прямой(Команда)
	
	РасшифроватьГрафы3и4ПрямойКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьГрафу4Распределенный(Команда)
	
	РасшифроватьГрафу4РаспределенныйКлиент();
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
    РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПравилаЗаполненияДекларацииС4кв2020 = УчетНДС.ПравилаЗаполненияДекларацииС4кв2020(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияПодтверждающихДокументов(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект.НеоблагаемыеНДСОперации.НайтиПоИдентификатору(ВыбранноеЗначение);
	
	//Если НЕ ДанныеСтроки.КодСт149НКРФ
	//	ИЛИ ДанныеСтроки.КодСт149НКРФ И 
	//	НЕ ЗначениеЗаполнено(ДанныеСтроки.Контрагент) 
	//	И НЕ ДанныеСтроки.КонтрагентОбязательный Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресТаблицыПодтверждающиеДокументы", ПоместитьПодтверждающиеДокументыВХранилище(ДанныеСтроки.КлючСтроки));
	ПараметрыФормы.Вставить("ТолькоПросмотр", ЭтаФорма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("КлючСтроки", ДанныеСтроки.КлючСтроки);
	
	ОткрытьФорму("Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Форма.ФормаРедактированияПодтверждающихДокументов", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьПодтверждающиеДокументыВХранилище(КлючСтроки)
	
	СтруктураОтбора = Новый Структура("КлючСтроки", КлючСтроки);
	ТаблицаПодтверждающиеДокументы = Объект.ПодтверждающиеДокументы.Выгрузить(СтруктураОтбора);
	АдресТаблицыПодтверждающиеДокументы = ПоместитьВоВременноеХранилище(ТаблицаПодтверждающиеДокументы, УникальныйИдентификатор);
	
	Возврат АдресТаблицыПодтверждающиеДокументы;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодтверждающиеДокументыИзХранилища(КлючСтроки)
	
	ТаблицаПодтверждающиеДокументы = ПолучитьИзВременногоХранилища(АдресТаблицыПодтверждающиеДокументы);
	
	Для Каждого СтрокаТЧ Из ТаблицаПодтверждающиеДокументы Цикл
		НоваяСтрока = Объект.ПодтверждающиеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
	
	КлючПоиска = Новый Структура("КлючСтроки", КлючСтроки);
	МассивСтрокНеоблагаемыеОперации = Объект.НеоблагаемыеНДСОперации.НайтиСтроки(КлючПоиска);
	Если МассивСтрокНеоблагаемыеОперации.Количество() > 0 Тогда 
		СтрокаТаблицы = МассивСтрокНеоблагаемыеОперации[0];
		Если ТаблицаПодтверждающиеДокументы.Количество() > 0 Тогда 
			ЗаполнитьПодтверждающиеДокументы(СтрокаТаблицы, ТаблицаПодтверждающиеДокументы);
		Иначе
			СтрокаТаблицы.ПодтверждающиеДокументыПредставление = "<...>";
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьДокументЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаполнениеДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеДокумента()

	ИБФайловая = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая;
	Результат = ЗаполнитьДокументНаСервере(ИБФайловая);
	
	Если Результат.ЗаданиеВыполнено Тогда
		ОповеститьОбИзменении(Объект.Ссылка);
	Иначе
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
		
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			ЗагрузитьПодготовленныеДанные();
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Функция ЗаполнитьДокументНаСервере(ИБФайловая)
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	Объект.НеоблагаемыеНДСОперации.Очистить();
	Объект.ПодтверждающиеДокументы.Очистить();
	
	СтруктураПараметров = Новый Структура("Организация, Дата", Объект.Организация, Объект.Дата);
	
	Если ИБФайловая Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища);
		Результат = Новый Структура("ЗаданиеВыполнено", Истина);
		
	Иначе
		НаименованиеЗадания = НСтр("ru = 'Заполнение документа ""Формирование записей раздела 7 Декларации НДС""'");
		
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор, 
		"Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.ПодготовитьДанныеДляЗаполнения", 
		СтруктураПараметров, 
		НаименованиеЗадания);
		
		АдресХранилища = Результат.АдресХранилища;
		
	КонецЕсли;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("НеоблагаемыеНДСОперации") Тогда
		Объект.НеоблагаемыеНДСОперации.Загрузить(СтруктураДанных.НеоблагаемыеНДСОперации);
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("ПодтверждающиеДокументы") Тогда
		Объект.ПодтверждающиеДокументы.Загрузить(СтруктураДанных.ПодтверждающиеДокументы);
	КонецЕсли;
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ОбновитьИтогиВПодвале(ЭтаФорма);
	Модифицированность = Истина;
	
	РассчитаныГрафы3и4Прямой = Ложь;
	РассчитанаГрафа4Распределенный = Ложь;
	НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПодтверждающиеДокументы(СтрокаТабличнойЧасти, ПодтверждающиеДокументыПоСтроке)
	
	ПодтверждающиеДокументыПредставление = "";
	КоличествоПодтверждающихДокументов = ПодтверждающиеДокументыПоСтроке.Количество();
	Для Инд = 0 По КоличествоПодтверждающихДокументов - 1 Цикл
		
		ПодтверждающийДокумент = ПодтверждающиеДокументыПоСтроке[Инд];
		Если Инд = 2 Тогда
			ПодтверждающиеДокументыПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 и еще %2'"),
				ПодтверждающиеДокументыПредставление, 
				КоличествоПодтверждающихДокументов - 2);
				
		Иначе
			ПодтверждающиеДокументыПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1%2%3 №%4 от %5'"),
				ПодтверждающиеДокументыПредставление, 
				?(ЗначениеЗаполнено(ПодтверждающиеДокументыПредставление), ";", ""),
				Строка(ПодтверждающийДокумент.ТипДокумента),
				ПодтверждающийДокумент.НомерДокумента,
				Формат(ПодтверждающийДокумент.ДатаДокумента,"ДЛФ=D"));
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаТабличнойЧасти.ПодтверждающиеДокументыПредставление = ПодтверждающиеДокументыПредставление;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ИнициализироватьСтруктуруУчетнойПолитики();
	
	ТекущаяДатаДокумента = Объект.Дата;
	
	УстановитьФункциональныеОпцииФормы();
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруУчетнойПолитики()
	
	НастройкиУчетаНДС = Новый ФиксированнаяСтруктура(
		УчетНДС.ПолучитьНастройкиУчетаНДСУчреждения(Объект.Организация, Объект.Дата));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыИзПараметровФормы(ЭтотОбъект)
	
	ПараметрыЗаполненияФормы = Неопределено;
	
	Если ЭтотОбъект.Параметры.Свойство("ПараметрыЗаполненияФормы",ПараметрыЗаполненияФормы) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.Объект,ПараметрыЗаполненияФормы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()
	
	КодыОпераций = ОбщегоНазначения.ВыгрузитьКолонку(Объект.НеоблагаемыеНДСОперации, "КодОперации", Истина);
	РеквизитыКодов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		КодыОпераций,
		"ОперацияНеПодлежитНалогообложению, ВключаетсяВРеестрПодтверждающихДокументов");
	КодыРеализацийНеНаТерриторииРФ = Справочники.КодыОперацийРаздела7ДекларацииПоНДС.КодыРеализацииНеНаТерриторииРФ();
	
	Для каждого СтрокаТаблицы Из Объект.НеоблагаемыеНДСОперации Цикл
		РеквизитыКода = РеквизитыКодов.Получить(СтрокаТаблицы.КодОперации);
		
		СтрокаТаблицы.КодСт149НКРФ      = ?(РеквизитыКода <> Неопределено, 
			РеквизитыКода.ОперацияНеПодлежитНалогообложению, Ложь);
		СтрокаТаблицы.ВключаетсяВРеестр = ?(РеквизитыКода <> Неопределено, 
			РеквизитыКода.ВключаетсяВРеестрПодтверждающихДокументов, Ложь);
		СтрокаТаблицы.КонтрагентОбязательный = УчетНДСКлиентСервер.КонтрагентОбязательный(СтрокаТаблицы.ДокументРеализации);
		
		СтрокаТаблицы.ТребуетсяЗаполнениеГраф3И4 = ТребуетсяЗаполнениеГраф3И4(
			СтрокаТаблицы.КодОперации,
			СтрокаТаблицы.КодСт149НКРФ,
			ПравилаЗаполненияДекларацииС4кв2020,
			КодыРеализацийНеНаТерриторииРФ,
			НастройкиУчетаНДС);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Для кодов, которые не попадают в реестр, заполнять подтверждающие документы не требуется.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(
		ЭлементУО.Поля, "НеоблагаемыеНДСОперацииПодтверждающиеДокументыПредставление");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НеоблагаемыеНДСОперации.ВключаетсяВРеестр", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуются>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Если представление не заполнено, то отображаем ссылку "Подтверждающие документы" до отработки обработчика обновления.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(
		ЭлементУО.Поля, "НеоблагаемыеНДСОперацииПодтверждающиеДокументыПредставление");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НеоблагаемыеНДСОперации.ПодтверждающиеДокументыПредставление", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НеоблагаемыеНДСОперации.ВключаетсяВРеестр", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Подтверждающие документы'"));
	
	УстановитьУсловноеОформление_НедоступностьГраф3и4();
	
	// Для некоторых документов поле "Контрагент" может не заполняться.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НеоблагаемыеНДСОперацииКонтрагент");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НеоблагаемыеНДСОперации.КонтрагентОбязательный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_НедоступностьГраф3и4()
	
	// С 01.10.2020 года графы 3 и 4 заполняются по всем операциям 7 раздела декларации, кроме операций реализации не на территории РФ,
	// до 01.10.2020 года по операциям, соответствующим ст. 149 НК РФ
	
	ИмяТЧ = "НеоблагаемыеНДСОперации";
	
	ИменаПолей = Новый Массив();
	ИменаПолей.Добавить("СуммаПриобретения");
	ИменаПолей.Добавить("НДСПрямой");
	ИменаПолей.Добавить("НДСРаспределенный");
	
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, СтрШаблон("%1%2", ИмяТЧ, ИмяПоля));
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.НеоблагаемыеНДСОперации.ТребуетсяЗаполнениеГраф3И4", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			СтрШаблон("Объект.%1.%2", ИмяТЧ, ИмяПоля), ВидСравненияКомпоновкиДанных.НеЗаполнено);
			
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуется>'"));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НеоблагаемыеНДСОперацииПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.НеоблагаемыеНДСОперации.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого ИдСтроки Из ВыделенныеСтроки Цикл
		ТекДанные = Объект.НеоблагаемыеНДСОперации.НайтиПоИдентификатору(ИдСтроки);
		Если ТекДанные <> Неопределено Тогда
			// Необходимо очистить дополнительные сведения
			НоваяСтрока = ТаблицаУдаленныхКлючей.Добавить();
			НоваяСтрока.КлючСтроки = ТекДанные.КлючСтроки;
		КонецЕсли;
	КонецЦикла;
	ПодключитьОбработчикОжидания("Подключаемый_УдалитьСвязанныеЗаписи", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьСвязанныеЗаписи()
	
	УдалитьСвязанныеЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСвязанныеЗаписиНаСервере()
	
	Для каждого СтрокаКлюча Из ТаблицаУдаленныхКлючей Цикл
		КлючПоиска = Новый Структура("КлючСтроки", СтрокаКлюча.КлючСтроки);
		МассивСтрокТовары = Объект.ПодтверждающиеДокументы.НайтиСтроки(КлючПоиска);
		
		Для каждого СтрокаТЧ Из МассивСтрокТовары Цикл
			Объект.ПодтверждающиеДокументы.Удалить(СтрокаТЧ);
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаУдаленныхКлючей.Очистить();
	
КонецПроцедуры

&НаСервере
Функция РеквизитыКодаОперации(КодОперации)
	
	Если ЗначениеЗаполнено(КодОперации) Тогда
		РеквизитыКода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КодОперации, "ОперацияНеПодлежитНалогообложению, ВключаетсяВРеестрПодтверждающихДокументов");
	Иначе
		РеквизитыКода = Новый Структура("ОперацияНеПодлежитНалогообложению, ВключаетсяВРеестрПодтверждающихДокументов", Ложь, Ложь);
	КонецЕсли;
	
	// Дополним признаком необходимости заполнения граф 3 и 4 декларации.
	КодыРеализацийНеНаТерриторииРФ = Справочники.КодыОперацийРаздела7ДекларацииПоНДС.КодыРеализацииНеНаТерриторииРФ();
	
	РеквизитыКода.Вставить("ТребуетсяЗаполнениеГраф3И4", ТребуетсяЗаполнениеГраф3И4(
		КодОперации,
		РеквизитыКода.ОперацияНеПодлежитНалогообложению,
		ПравилаЗаполненияДекларацииС4кв2020,
		КодыРеализацийНеНаТерриторииРФ,
		НастройкиУчетаНДС));
	
	Возврат РеквизитыКода;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтогиВПодвале(ЭтотОбъект)
	
	Объект = ЭтотОбъект.Объект;
	
	ЭтотОбъект.ИтогиВсегоНДС = Объект.НеоблагаемыеНДСОперации.Итог("НДСПрямой")
		+Объект.НеоблагаемыеНДСОперации.Итог("НДСРаспределенный");
		
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииОрганизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.НеоблагаемыеНДСОперации.Очистить();
		Объект.ПодтверждающиеДокументы.Очистить();
	Иначе
		Объект.Организация = ТекущаяОрганизация;
	КонецЕсли;
	
	ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОрганизации()
	
	ТекущаяОрганизация = Объект.Организация;
	
	ИнициализироватьСтруктуруУчетнойПолитики();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатыСервер()
	
	ИнициализироватьСтруктуруУчетнойПолитики();
	
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		РассчитатьГрафы3и4Клиент(Ложь);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		РассчитаныГрафы3и4Прямой = Истина;
		РассчитанаГрафа4Распределенный = Истина;
		НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстКоличествоСтрокДляПереноса(Текст, КоличествоСтрокДляПереноса)
	Массив = ПолучитьСклоненияСтрокиПоЧислу(Текст,КоличествоСтрокДляПереноса,,,"ПД=Винительный");
	Возврат Массив[0];
КонецФункции

&НаКлиенте
Процедура ВопросПеренестиЛишниеСтрокиТЧВДругойДокумент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПеренестиЛишниеСтрокиТЧВДругойДокумент(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПеренестиЛишниеСтрокиТЧВДругойДокумент(ДополнительныеПараметры)
	
	Если ПеренестиЛишниеСтрокиТЧВДругойДокументНаСервере(ДополнительныеПараметры) Тогда
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Создание:'"),,
			ТекстКоличествоСтрокДляПереноса("последняя строка",ДополнительныеПараметры.КоличествоСтрокДляПереноса)+
			НСтр("ru = ' табличных частей перенесли успешно.'"),
			БиблиотекаКартинок.Информация32,
			СтатусОповещенияПользователя.Информация);
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = ' Не удалось создать новый документ для переноса строк табличных частей.'");
		Сообщение.Сообщить();
		
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Функция ПеренестиЛишниеСтрокиТЧВДругойДокументНаСервере(ДополнительныеПараметры)
	
	РежимЗаписи = ДополнительныеПараметры.РежимЗаписи;
	
	ИндексПоследнийСтроки = Объект.НеоблагаемыеНДСОперации.Количество()-1;
	МаксимальноеКоличествоСтрок = ДополнительныеПараметры.МаксимальноеКоличествоСтрок;
	КоличествоСтрокДляПереноса = ДополнительныеПараметры.КоличествоСтрокДляПереноса;
	
	ИндексСтроки = 0;
	СтрокиДляУдаленияНеоблагаемыеНДСОперации = Новый Массив;
	СтрокиДляУдаленияПодтверждающиеДокументы = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка
		
		КоличествоСтрокТЧ = 0;
		
		Пока ИндексСтроки < КоличествоСтрокДляПереноса Цикл
			
			Если КоличествоСтрокТЧ = 0 Тогда
				НовыйДокументОбъект = Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.СоздатьДокумент();
				НовыйДокументОбъект.Дата = Объект.Дата;
				НовыйДокументОбъект.Организация = Объект.Организация;
				НовыйДокументОбъект.Ответственный = Объект.Ответственный;
			КонецЕсли;
			
			СтрокаНеоблагаемыеНДСОперацииНовогоДокумента = НовыйДокументОбъект.НеоблагаемыеНДСОперации.Добавить();
			СтрокаНеоблагаемыеНДСОперацииТекущегоДокумента = Объект.НеоблагаемыеНДСОперации[ИндексПоследнийСтроки - ИндексСтроки];
			СтрокиДляУдаленияНеоблагаемыеНДСОперации.Добавить(СтрокаНеоблагаемыеНДСОперацииТекущегоДокумента);
			ЗаполнитьЗначенияСвойств(СтрокаНеоблагаемыеНДСОперацииНовогоДокумента,СтрокаНеоблагаемыеНДСОперацииТекущегоДокумента);
			
			КлючПоиска = Новый Структура("КлючСтроки", СтрокаНеоблагаемыеНДСОперацииТекущегоДокумента.КлючСтроки);
			МассивСтрокТовары = Объект.ПодтверждающиеДокументы.НайтиСтроки(КлючПоиска);
			
			Для каждого СтрокаТЧ Из МассивСтрокТовары Цикл
				СтрокаПодтверждающиеДокументыНовогоДокумента = НовыйДокументОбъект.ПодтверждающиеДокументы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПодтверждающиеДокументыНовогоДокумента,СтрокаТЧ);
				СтрокиДляУдаленияПодтверждающиеДокументы.Добавить(СтрокаТЧ);
			КонецЦикла;
			
			КоличествоСтрокТЧ = КоличествоСтрокТЧ + 1;
			
			ИндексСтроки = ИндексСтроки + 1;
			
			Если КоличествоСтрокТЧ = МаксимальноеКоличествоСтрок
				ИЛИ ИндексСтроки = КоличествоСтрокДляПереноса Тогда
				НовыйДокументОбъект.Записать(РежимЗаписи);
				КоличествоСтрокТЧ = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого СтрокаНеоблагаемыеНДСОперации Из СтрокиДляУдаленияНеоблагаемыеНДСОперации Цикл
			Объект.НеоблагаемыеНДСОперации.Удалить(СтрокаНеоблагаемыеНДСОперации);
		КонецЦикла;
			
		Для каждого СтрокаПодтверждающиеДокументы Из СтрокиДляУдаленияПодтверждающиеДокументы Цикл
			Объект.ПодтверждающиеДокументы.Удалить(СтрокаПодтверждающиеДокументы);
		КонецЦикла;
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.Записать(РежимЗаписи);
		
	Исключение
		
		ОтменитьТранзакцию();
		Возврат Ложь;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	ЭтаФорма.Прочитать();
	
	Возврат Истина;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьИндикаторТребуетсяПересчет(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаТребуетсяПересчет.ТекущаяСтраница = ?(Форма.РассчитаныГрафы3и4Прямой И Форма.РассчитанаГрафа4Распределенный,
		Элементы.ГруппаТребуетсяПересчетСкрыто,
		Элементы.ГруппаТребуетсяПересчетПоказано);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОНеуказанииПодтверждающихДокументов()
	
	ПоказатьПредупреждение(,
		НСтр("ru='Указанный в текущей строке код операции не включается в реестр подтверждающих документов, поэтому список документов не редактируется.'"));
	
КонецПроцедуры

// Расчет граф 3 и 4

&НаКлиенте
Процедура ПроверитьПередРасчетомГраф3и4(Отказ)
	
	Если ПрименяетсяУСНбезЗаполненияГраф3И4(НастройкиУчетаНДС) Тогда
		Отказ = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='Учреждение применяет УСН и налоговую ставку НДС %1.
			|В таком случае графы 3 и 4 не заполняются.'"),
			НастройкиУчетаНДС.СтавкаНДСПоУмолчаниюПриУСН);
		
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТребуетсяЗаполнениеГраф3И4(КодОперации, ЭтоКодСт149НКРФ, ЭтоПравилаЗаполненияДекларацииС4кв2020,
		КодыРеализацийНеНаТерриторииРФ, НастройкиУчетаНДС)
	
	Если Не ЗначениеЗаполнено(КодОперации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПрименяетсяУСНбезЗаполненияГраф3И4(НастройкиУчетаНДС) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоРеализацияНаТерриторииРФ = (КодыРеализацийНеНаТерриторииРФ.Найти(КодОперации) = Неопределено);
	
	Возврат ЭтоРеализацияНаТерриторииРФ
		Или (ЭтоКодСт149НКРФ И Не ЭтоПравилаЗаполненияДекларацииС4кв2020);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПрименяетсяУСНбезЗаполненияГраф3И4(НастройкиУчетаНДС)
	
	УчетнаяПолитика = НастройкиУчетаНДС.УчетнаяПолитика;
	
	Возврат УчетнаяПолитика.ПрименяетсяУСН
		И (УчетнаяПолитика.СтавкаНалогообложенияПриУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ПониженнаяУСН")
			Или УчетнаяПолитика.СтавкаНалогообложенияПриУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ОбщаяУСН"));
	
КонецФункции

&НаСервере
Процедура ОчиститьНеиспользуемыеПоказателиСтроки(ИдСтроки)
	
	ТекДанные = Объект.НеоблагаемыеНДСОперации.НайтиПоИдентификатору(ИдСтроки);
	
	Если Не ТекДанные.ТребуетсяЗаполнениеГраф3И4 Тогда
		ОчищающаяСтруктура = Новый Структура("
			|СуммаПриобретения,
			|НДСПрямой,
			|НДСРаспределенный");
		
		ЗаполнитьЗначенияСвойств(ТекДанные, ОчищающаяСтруктура);
		
		ОбновитьИтогиВПодвале(ЭтотОбъект);
	КонецЕсли;
	
	Если Не ТекДанные.ВключаетсяВРеестр Тогда
		Поиск = Новый Структура("КлючСтроки", ТекДанные.КлючСтроки);
		
		МассивСтрок = Объект.ПодтверждающиеДокументы.НайтиСтроки(Поиск);
		
		Для Каждого УдаляемаяСтрока Из МассивСтрок Цикл
			Объект.ПодтверждающиеДокументы.Удалить(УдаляемаяСтрока);
		КонецЦикла;
		
		ТекДанные.ПодтверждающиеДокументыПредставление = "<...>";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСуммРеализацииДляЗаполненияГраф3и4()
	
	Поиск = Новый Структура("ТребуетсяЗаполнениеГраф3И4", Истина);
	
	МассивСуммРеализации = Объект.НеоблагаемыеНДСОперации.Выгрузить(Поиск, "СуммаРеализации").ВыгрузитьКолонку("СуммаРеализации");
	
	Для Индекс = 0 По МассивСуммРеализации.ВГраница() Цикл
		Если МассивСуммРеализации[Индекс] < 0 Тогда
			МассивСуммРеализации[Индекс] = -МассивСуммРеализации[Индекс];
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСуммРеализации;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьГрафы3и4Клиент(ЗадатьВопрос = Истина)
	
	Если Объект.НеоблагаемыеНДСОперации.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РассчитатьГрафы3и4_Завершение", ЭтотОбъект);
	
	Если ЗадатьВопрос Тогда
		ПоказатьВопрос(Оповещение, НСтр("ru='Рассчитать графы 3 и 4 пропорционально суммам реализации?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафы3и4_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗадания = ПолучитьЗаполнениеГраф3и4Сервер();
	
	Если РезультатЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияГраф3и4Клиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаполнениеГраф3и4Сервер()
	
	ШапкаДокумента = Новый Структура("Дата,Организация,Ссылка");
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, Объект);
	
	МассивКоэффициентов = ПолучитьМассивСуммРеализацииДляЗаполненияГраф3и4();
	
	Если МассивКоэффициентов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение граф 3 и 4'");
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаДокумента", ШапкаДокумента);
	ПараметрыПроцедуры.Вставить("МассивКоэффициентов", МассивКоэффициентов);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.СформироватьГрафы3и4",
		ПараметрыПроцедуры, ПараметрыЗадания);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияГраф3и4Клиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РассчитатьГрафы3и4Сервер(Результат.АдресРезультата);
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='При расчете граф 3 и 4 возникла ошибка'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьГрафы3и4Сервер(АдресРезультата)
	
	Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.РассчитатьГрафы3и4(Объект, АдресРезультата);
	
	РассчитаныГрафы3и4Прямой = Истина;
	РассчитанаГрафа4Распределенный = Истина;
	НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
	
	ОбновитьИтогиВПодвале(ЭтаФорма);
	
КонецПроцедуры

// Расчет граф 3 и 4-прямой

&НаКлиенте
Процедура РассчитатьГрафы3и4ПрямойКлиент()
	
	Если Объект.НеоблагаемыеНДСОперации.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РассчитатьГрафы3и4Прямой_Завершение", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, НСтр("ru='Рассчитать графы 3 и 4-прямой пропорционально суммам реализации?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафы3и4Прямой_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗадания = ПолучитьЗаполнениеГраф3и4ПрямойСервер();
	
	Если РезультатЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияГраф3и4ПрямойКлиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаполнениеГраф3и4ПрямойСервер()
	
	ШапкаДокумента = Новый Структура("Дата,Организация,Ссылка");
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, Объект);
	
	МассивКоэффициентов = ПолучитьМассивСуммРеализацииДляЗаполненияГраф3и4();
	
	Если МассивКоэффициентов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение граф 3 и 4-прямой'");
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаДокумента", ШапкаДокумента);
	ПараметрыПроцедуры.Вставить("МассивКоэффициентов", МассивКоэффициентов);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.СформироватьГрафы3и4Прямой",
		ПараметрыПроцедуры, ПараметрыЗадания);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияГраф3и4ПрямойКлиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РассчитатьГрафы3и4ПрямойСервер(Результат.АдресРезультата);
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='При расчете граф 3 и 4-прямой возникла ошибка'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьГрафы3и4ПрямойСервер(АдресРезультата)
	
	Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.РассчитатьГрафы3и4Прямой(Объект, АдресРезультата);
	
	РассчитаныГрафы3и4Прямой = Истина;
	НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
	
	ОбновитьИтогиВПодвале(ЭтаФорма);
	
КонецПроцедуры

// Расчет графы 4-распределенный

&НаКлиенте
Процедура РассчитатьГрафу4РаспределенныйКлиент()
	
	Если Объект.НеоблагаемыеНДСОперации.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РассчитатьГрафу4Распределенный_Завершение", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, НСтр("ru='Рассчитать графу 4-распределенный пропорционально суммам реализации?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафу4Распределенный_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗадания = ПолучитьЗаполнениеГрафы4РаспределенныйСервер();
	
	Если РезультатЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияГрафы4РаспределенныйКлиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаполнениеГрафы4РаспределенныйСервер()
	
	ШапкаДокумента = Новый Структура("Дата,Организация,Ссылка");
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, Объект);
	
	МассивКоэффициентов = ПолучитьМассивСуммРеализацииДляЗаполненияГраф3и4();
	
	Если МассивКоэффициентов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение графы 4-распределенный'");
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаДокумента", ШапкаДокумента);
	ПараметрыПроцедуры.Вставить("МассивКоэффициентов", МассивКоэффициентов);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.СформироватьГрафу4Распределенный",
		ПараметрыПроцедуры, ПараметрыЗадания);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияГрафы4РаспределенныйКлиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РассчитатьГрафу4РаспределенныйСервер(Результат.АдресРезультата);
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='При расчете графы 4-распределенный возникла ошибка'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьГрафу4РаспределенныйСервер(АдресРезультата)
	
	Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.РассчитатьГрафу4Распределенный(Объект, АдресРезультата);
	
	РассчитанаГрафа4Распределенный = Истина;
	НастроитьИндикаторТребуетсяПересчет(ЭтаФорма);
	
	ОбновитьИтогиВПодвале(ЭтаФорма);
	
КонецПроцедуры

// Расшифровка граф 3 и 4-прямой

&НаКлиенте
Процедура РасшифроватьГрафы3и4ПрямойКлиент()
	
	РезультатЗадания = ПолучитьРасшифровкуГрафы3и4ПрямойСервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеПолученияРасшифровкиГрафы3и4ПрямойКлиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуГрафы3и4ПрямойСервер()
	
	ШапкаДокумента = Новый Структура("Дата,Организация");
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, Объект);
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru='Расшифровка документов поступления'");
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаДокумента", ШапкаДокумента);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.СформироватьТабличныйДокументРасшифровкиГрафы3и4Прямой",
		ПараметрыПроцедуры, ПараметрыЗадания);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПолученияРасшифровкиГрафы3и4ПрямойКлиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Расшифровка граф 3 и 4-прямой'"));
		ПараметрыФормы.Вставить("АдресДокумента", Результат.АдресРезультата);
		
		ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТабличногоДокумента", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='При поиске документов поступления возникла ошибка'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

// Расшифровка графы 4-распределенный

&НаКлиенте
Процедура РасшифроватьГрафу4РаспределенныйКлиент()
	
	РезультатЗадания = ПолучитьРасшифровкуГрафы4РаспределенныйСервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеПолученияРасшифровкиГрафы4РаспределенныйКлиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуГрафы4РаспределенныйСервер()
	
	ШапкаДокумента = Новый Структура("Дата,Организация,Ссылка");
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, Объект);
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru='Расшифровка распределенного НДС'");
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаДокумента", ШапкаДокумента);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.СформироватьТабличныйДокументРасшифровкиГрафы4Распределенный",
		ПараметрыПроцедуры, ПараметрыЗадания);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПолученияРасшифровкиГрафы4РаспределенныйКлиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Расшифровка графы 4-распределенный'"));
		ПараметрыФормы.Вставить("АдресДокумента", Результат.АдресРезультата);
		
		ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТабличногоДокумента", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='При поиске распределенного НДС возникла ошибка'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
